# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.10-p001_1 on Fri Apr 11 02:05:37 CST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1000ps

# Set the current design
current_design acc_top

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load 0.1 [get_ports icb_cmd_ready]
set_load -pin_load 0.1 [get_ports icb_rsp_valid]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[31]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[30]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[29]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[28]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[27]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[26]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[25]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[24]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[23]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[22]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[21]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[20]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[19]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[18]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[17]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[16]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[15]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[14]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[13]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[12]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[11]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[10]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[9]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[8]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[7]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[6]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[5]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[4]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[3]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[2]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[1]}]
set_load -pin_load 0.1 [get_ports {icb_rsp_rdata[0]}]
set_load -pin_load 0.1 [get_ports icb_rsp_err]
set_load -pin_load 0.1 [get_ports {ofmap_out[15]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[14]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[13]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[12]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[11]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[10]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[9]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[8]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[7]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[6]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[5]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[4]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[3]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[2]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[1]}]
set_load -pin_load 0.1 [get_ports {ofmap_out[0]}]
set_load -pin_load 0.1 [get_ports done]
set_load -pin_load 0.1 [get_ports dout_valid]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports icb_cmd_valid]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports icb_cmd_read]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_addr[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wdata[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wmask[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wmask[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wmask[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports {icb_cmd_wmask[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 2.0 [get_ports icb_rsp_ready]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports icb_cmd_ready]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports icb_rsp_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {icb_rsp_rdata[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports icb_rsp_err]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {ofmap_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports done]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports dout_valid]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports clk]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports rst_n]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports icb_cmd_valid]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports icb_cmd_read]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[31]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[30]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[29]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[28]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[27]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[26]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[25]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[24]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[23]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[22]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[21]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[20]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[19]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[18]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[17]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[16]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[15]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[14]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[13]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[12]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[11]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[10]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[9]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[8]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[7]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[6]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[5]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_addr[0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[31]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[30]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[29]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[28]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[27]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[26]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[25]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[24]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[23]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[22]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[21]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[20]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[19]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[18]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[17]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[16]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[15]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[14]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[13]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[12]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[11]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[10]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[9]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[8]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[7]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[6]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[5]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wdata[0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wmask[3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wmask[2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wmask[1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {icb_cmd_wmask[0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports icb_rsp_ready]
set_wire_load_mode "enclosed"
