xrun(64): 20.09-s009: (c) Copyright 1995-2021 Cadence Design Systems, Inc.
TOOL:	xrun(64)	20.09-s009: Started on Apr 12, 2025 at 14:25:51 CST
xrun
	-R
	-input wave.tcl
Loading snapshot worklib.icb_slave_tb:sv .................... Done
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
xcelium> source /opt/cadence/xceliummain20.09/tools/xcelium/files/xmsimrc
xcelium> ida_database -open -name=net.db

[INDAGO]: Multi-Core recording is enabled

xcelium> 
xcelium> # probe -create -unpacked 3145728 pixel_shuffle_tb.test_memory
xcelium> 
xcelium> # Probe log messages to SmartLog DB
xcelium> ida_probe -log 
xcelium> 
xcelium> 
xcelium> # Probe all HDL, all levels
xcelium> ida_probe -wave -wave_probe_args=" -all -depth all -memories -packed 0 -unpacked 0 -tasks"
database -open net.db/net.shm 
Created SHM database net.db/net.shm

database -setdefault net.db/net.shm
net.db/net.shm is set as default SHM database

probe  -all -depth all -memories -packed 0 -unpacked 0 -tasks -emptyok
xmsim: *W,PRHOPT: The design contains optimized signals. To improve simulation performance these signals are excluded.
Created probe 1

xcelium> 
xcelium> run

Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (RN_AND_NEG_SE === 1'b1):75 NS, negedge D:75 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4424
           Scope: icb_slave_tb.acc_top.u_icb_slave.\RAM_SEL_reg[0] 
            Time: 75 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (NEG_SE_AND_SN === 1'b1):75 NS, posedge D:75 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4763
           Scope: icb_slave_tb.acc_top.u_icb_slave.\RAM_SEL_reg[1] 
            Time: 75 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (RN_AND_SE === 1'b1):75 NS, negedge SI:75 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4426
           Scope: icb_slave_tb.acc_top.u_icb_slave.\STAT_REG_CAL_reg[0] 
            Time: 75 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (NEG_SE_AND_SN === 1'b1):175 NS, negedge D:175 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4762
           Scope: icb_slave_tb.acc_top.u_icb_slave.\RAM_SEL_reg[1] 
            Time: 175 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (RN_AND_NEG_SE === 1'b1):214275 NS, posedge D:214275 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4425
           Scope: icb_slave_tb.acc_top.u_icb_slave.\RAM_SEL_reg[0] 
            Time: 214275 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (NEG_SE_AND_SN === 1'b1):214275 NS, negedge D:214275 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4762
           Scope: icb_slave_tb.acc_top.u_icb_slave.\RAM_SEL_reg[1] 
            Time: 214275 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (RN_AND_SE === 1'b1):214275 NS, posedge SI:214275 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4427
           Scope: icb_slave_tb.acc_top.u_icb_slave.\STAT_REG_CAL_reg[0] 
            Time: 214275 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (RN_AND_NEG_SE === 1'b1):214375 NS, negedge D:214375 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4424
           Scope: icb_slave_tb.acc_top.u_icb_slave.\RAM_SEL_reg[0] 
            Time: 214375 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (NEG_SE_AND_SN === 1'b1):214375 NS, posedge D:214375 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4763
           Scope: icb_slave_tb.acc_top.u_icb_slave.\RAM_SEL_reg[1] 
            Time: 214375 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (RN_AND_NEG_SE === 1'b1):263375 NS, posedge D:263375 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4425
           Scope: icb_slave_tb.acc_top.u_icb_slave.\RAM_SEL_reg[0] 
            Time: 263375 NS


Warning!  Timing violation
           $setuphold<hold>( posedge CK &&& (RN_AND_SE === 1'b1):263475 NS, negedge SI:263475 NS,  0.100 : 100 PS,  0.100 : 100 PS );
            File: /home/sakamoto/NangateOpenCellLibrary/Front_End/Verilog/NangateOpenCellLibrary.v, line = 4426
           Scope: icb_slave_tb.acc_top.u_icb_slave.\STAT_REG_CAL_reg[0] 
            Time: 263475 NS

Simulation interrupted at 216940050 NS + 0
xcelium> 
xmsim: *W,CMUSEX: Control-D in interactive input - one more to exit.
xcelium> exit
TOOL:	xrun(64)	20.09-s009: Exiting on Apr 12, 2025 at 14:26:19 CST  (total: 00:00:28)
